In [75]:
import pandas as pd

## 예제 8-4  사용자 정의 함수를 apply 메소드로  처리하기

In [65]:
import numpy as np

In [66]:
df = pd.DataFrame ({'a' : np.random.randn(6),
                 'b' : ['철수', '영희'] * 3,
                 'c' : np.random.randn(6)})

In [67]:
df

          a   b         c
0 -0.633377  철수 -0.090787
1 -0.512361  영희  2.293869
2  0.589508  철수  0.730095
3 -0.428108  영희 -0.839094
4 -0.909623  철수 -1.233800
5  1.033352  영희  0.630111

In [68]:
# 복잡한 연산도 처리가 가능하다
def my_test(a, c):
    return a % c

In [69]:
# lambda 함수는 행단위로 데이터를 처리하는 사용자 함수를 작성한다.
df['Value'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

In [70]:
df

          a   b         c     Value
0 -0.633377  철수 -0.090787 -0.088656
1 -0.512361  영희  2.293869  1.781508
2  0.589508  철수  0.730095  0.589508
3 -0.428108  영희 -0.839094 -0.428108
4 -0.909623  철수 -1.233800 -0.909623
5  1.033352  영희  0.630111  0.403241

In [71]:
df.a % df.c

0   -0.088656
1    1.781508
2    0.589508
3   -0.428108
4   -0.909623
5    0.403241
dtype: float64

In [72]:
# 일반함수는 데이터 프레임 전체를 넘겨 열 전체의 값을 반환하는 형태로 작성한다.
def my_test2(df):
    return df['a'] % df['c']

In [73]:
# lamda 함수를 쓰지않았을 때
df['Value 2'] = df.apply(my_test2, axis=1)

In [11]:
df

          a   b         c     Value   Value 2
0  1.017109  철수  1.577329  1.017109  1.017109
1 -1.075655  영희  1.407192  0.331537  0.331537
2  0.811740  철수 -0.900245 -0.088506 -0.088506
3  0.928797  영희  0.805131  0.123666  0.123666
4  0.123940  철수 -0.338729 -0.214789 -0.214789
5 -1.143865  영희 -0.851169 -0.292696 -0.292696

%timeit 를 통해 서로 다른 방식에 대한 성능 비교를 할 수 있다.

In [80]:
%timeit df['Value3'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

670 µs ± 18.3 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [79]:
%timeit df['Value4'] = df.apply(my_test2, axis=1)

803 µs ± 39.1 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [14]:
sample = pd.DataFrame({'임의의값':[10,100,40] })

In [15]:
sample

   임의의값
0    10
1   100
2    40

In [16]:
# 기존의 데이터 3개와 10만개의 데이터를 곱하여 30만개의 데이터를 생성한다.
# 인덱스는 갱신되어야 하므로 reset_index 함수 인자에 drop=True를 하면 새로운 인덱스로 갱신이된다.
sample = pd.concat([sample]*100000).reset_index(drop=True)

In [17]:
sample.shape

(300000, 1)

In [18]:
sample.head(10)

   임의의값
0    10
1   100
2    40
3    10
4   100
5    40
6    10
7   100
8    40
9    10

In [19]:
sample.shape

(300000, 1)

In [20]:
%timeit sample['임의의값'].apply(lambda x: np.nan if x < 90 else x)

74.7 ms ± 591 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [21]:
# 자기자신의 값은 변경되지 않으므로 추후 복제해서 적용해 본다.
sample.head()

   임의의값
0    10
1   100
2    40
3    10
4   100

In [22]:
%timeit sample['임의의값'].mask(sample['임의의값'] < 90, np.nan)

3.38 ms ± 130 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
sample1 = sample.copy()

In [24]:
sample1 = sample1['임의의값'].apply(lambda x: np.nan if x < 90 else x)

In [25]:
sample1.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [26]:
sample2 = sample.copy()

In [27]:
# mask, apply 함수를 썼을 때 둘다 같은 값이 나온다.
sample2 = sample2['임의의값'].mask(sample['임의의값'] < 90, np.nan)

In [28]:
sample2.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [29]:
(sample1 == sample2).shape

(300000,)

In [30]:
sample1.isnull().sum(), sample1.notnull().sum()

(200000, 100000)

In [31]:
(sample1 == sample2).sum()

100000

## 예제 8-5  사용자 정의 함수를 map,applymap메소드로  처리하기

In [32]:
import numpy as np

In [33]:
ser = pd.Series(np.random.randn(6))

In [34]:
ser

0    0.303329
1    0.486217
2    1.984239
3    0.685692
4   -0.557201
5   -1.298643
dtype: float64

In [35]:
df = pd.DataFrame(ser,columns=['관측값_A'])
df

      관측값_A
0  0.303329
1  0.486217
2  1.984239
3  0.685692
4 -0.557201
5 -1.298643

In [36]:
def map_test(a):
    print(" 원소별 처리")
    return np.abs(a)

In [37]:
ser.map(map_test)

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

0    0.303329
1    0.486217
2    1.984239
3    0.685692
4    0.557201
5    1.298643
dtype: float64

In [38]:
s = pd.Series(ser.map(map_test))

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

In [39]:
s

0    0.303329
1    0.486217
2    1.984239
3    0.685692
4    0.557201
5    1.298643
dtype: float64

In [40]:
df['관측값_A_절대값']=s
df

      관측값_A  관측값_A_절대값
0  0.303329   0.303329
1  0.486217   0.486217
2  1.984239   1.984239
3  0.685692   0.685692
4 -0.557201   0.557201
5 -1.298643   1.298643

## 예제 8-6 pipe 메소드 처리하기

In [41]:
import numpy as np

In [42]:
df = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [43]:
df

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [44]:
# 이름의 길이를 반환해주는 함수 생성
def name_length(df) :
    df['length'] = df.name.str.len()
    return df

In [45]:
# 판다스에서 pipe라는 함수로도 사용자 정의 함수를 지정할 수 있다.

In [46]:
df.pipe(name_length)

  name program language       born  length
0  김상갑              NaN        NaT       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala        NaT       3

In [47]:
def born_fillna(df) :
    df['born'] = df['born'].fillna(pd.Timestamp("1967-04-25"))
    return df

In [48]:
df.pipe(born_fillna)

  name program language       born  length
0  김상갑              NaN 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [49]:
def pl_fillna(df) :
    df['program language'] = df['program language'].fillna("Java")
    return df

In [50]:
df.pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [51]:
df1 = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [52]:
df1

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [53]:
df1.pipe(name_length).pipe(born_fillna).pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [54]:
df2 = pd.DataFrame()

In [55]:
df2['name'] = ['은옥찬', '은석찬', '은옥주']
df2['gender'] = ['Male', 'Male', 'Female']
df2['age'] = [31, 32, 19]

In [56]:
df2

  name  gender  age
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [57]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [58]:
mean_age_by_group(df2, 'gender')

         age
gender
Female  19.0
Male    31.5

In [59]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [60]:
uppercase_column_name(df2)

  NAME  GENDER  AGE
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [61]:
df3 = pd.DataFrame()

In [62]:
df3['name'] = ['구옥찬', '구석찬', '구옥주']
df3['gender'] = ['Male', 'Male', 'Female']
df3['age'] = [31, 32, 19]

In [63]:
(df3.pipe(mean_age_by_group, col='gender')
   .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5